en/e2fsprogs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-06 Tue 12:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>e2fsprogs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="e2fsprogs - Linux Commands">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="e2fsprogs - Linux Commands">
<meta property="og:description" content="">
<meta name="twitter:title" content="e2fsprogs - Linux Commands">
<meta name="twitter:description" content="">
<link rel="alternate" href="http://linux-command.org/en/e2fsprogs.html" hreflang="en" />
<link rel="alternate" href="http://linux-command.org/es/e2fsprogs.html" hreflang="es" />
<link rel="alternate" href="http://linux-command.org/ja/e2fsprogs.html" hreflang="ja" />
<link rel="alternate" href="http://linux-command.org/ko/e2fsprogs.html" hreflang="ko" />
<link rel="alternate" href="http://linux-command.org/zh/e2fsprogs.html" hreflang="zh" />
</head>
<body>
<div id="content">
<h1 class="title">e2fsprogs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#how-to-install">How to Install</a>
<ul>
<li><a href="#install">Install</a>
<ul>
<li><a href="#orgc2feeff">Ubuntu</a></li>
<li><a href="#org871f267">CentOS</a></li>
<li><a href="#org63cc4cc">from Source code</a></li>
</ul>
</li>
<li><a href="#packages">Installed Packages</a></li>
<li><a href="#check">Check</a>
<ul>
<li><a href="#orgec4886d">badblocks</a></li>
<li><a href="#org64ac5e9">blkid</a></li>
<li><a href="#org1ba8dac">chattr</a></li>
<li><a href="#org9f1b29d">debugfs</a></li>
<li><a href="#org7902fd9">dumpe2fs</a></li>
<li><a href="#org49764d6">e2freefrag</a></li>
<li><a href="#orgfc0b005">e2fsck</a></li>
<li><a href="#org9851130">e2image</a></li>
<li><a href="#orgdbc5003">e2label</a></li>
<li><a href="#org5d87f0b">e2undo</a></li>
<li><a href="#orgbbe2b90">e4defrag</a></li>
<li><a href="#org2cb3e7b">filefrag</a></li>
<li><a href="#orgc88df9a">findfs</a></li>
<li><a href="#org07dcddf">findsuper</a></li>
<li><a href="#orgae7d249">logsave</a></li>
<li><a href="#orgee91ab9">lsattr</a></li>
<li><a href="#org8398c18">mke2fs</a></li>
<li><a href="#orgbd6a453">resize2fs</a></li>
<li><a href="#org9b849fe">tune2fs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#usage">Usage</a>
<ul>
<li>
<ul>
<li><a href="#orgeb06984">badblocks</a></li>
<li><a href="#orgfcac701">blkid</a></li>
<li><a href="#orgab959b2">chattr</a></li>
<li><a href="#orgc47917c">debugfs</a></li>
<li><a href="#orge51705e">dumpe2fs</a></li>
<li><a href="#orgabf8ca6">e2freefrag</a></li>
<li><a href="#orgb9575ea">e2fsck</a></li>
<li><a href="#orgdfd17b8">e2image</a></li>
<li><a href="#orge82cb81">e2label</a></li>
<li><a href="#orge0213b6">e2undo</a></li>
<li><a href="#org4c2269e">e4defrag</a></li>
<li><a href="#orgb1a279d">filefrag</a></li>
<li><a href="#orgac8efba">findfs</a></li>
<li><a href="#org406bcba">findsuper</a></li>
<li><a href="#orgffa8c78">logsave</a></li>
<li><a href="#orge6034b1">lsattr</a></li>
<li><a href="#org8f88c28">mke2fs</a></li>
<li><a href="#orgf35d6a3">resize2fs</a></li>
<li><a href="#orgd09feb6">tune2fs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#references">References</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Version</td>
<td class="org-left"><span class="org-programming-version">1.43.9</span></td>
</tr>

<tr>
<td class="org-left">Release Date</td>
<td class="org-left"><span class="org-programming-date">2018-02-08</span></td>
</tr>

<tr>
<td class="org-left">License</td>
<td class="org-left">GPL</td>
</tr>

<tr>
<td class="org-left">Programming Language</td>
<td class="org-left">C</td>
</tr>
</tbody>
</table>

<div id="outline-container-org10fd8de" class="outline-2">
<h2 id="how-to-install"><a id="org10fd8de"></a>How to Install</h2>
<div class="outline-text-2" id="text-how-to-install">
</div>

<div id="outline-container-org8072619" class="outline-3">
<h3 id="install"><a id="org8072619"></a>Install</h3>
<div class="outline-text-3" id="text-install">
</div>

<div id="outline-container-orgc2feeff" class="outline-4">
<h4 id="orgc2feeff">Ubuntu</h4>
<div class="outline-text-4" id="text-orgc2feeff">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install es2fsprogs
</pre>
</div>
</div>
</div>

<div id="outline-container-org871f267" class="outline-4">
<h4 id="org871f267">CentOS</h4>
<div class="outline-text-4" id="text-org871f267">
<div class="org-src-container">
<pre class="src src-sh">$ sudo yum install es2fsprogs
</pre>
</div>
</div>
</div>

<div id="outline-container-org63cc4cc" class="outline-4">
<h4 id="org63cc4cc">from Source code</h4>
<div class="outline-text-4" id="text-org63cc4cc">
<div class="org-src-container">
<pre class="src src-sh">$ git clone https://git.kernel.org/pub/scm/fs/ext2/e2fsprogs.git
$ mkdir build
$ cd build
$ ../configure
$ make
$ make check
$ sudo make install
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf44addb" class="outline-3">
<h3 id="packages"><a id="orgf44addb"></a>Installed Packages</h3>
<div class="outline-text-3" id="text-packages">
<ul class="org-ul">
<li><a href="./badblocks.html">badblocks</a>
search a device for bad blocks</li>
<li><a href="./blkid.html">blkid</a>
locate/print block device attributes</li>
<li><a href="./chattr.html">chattr</a>
change file attributes on a Linux file system</li>
<li><a href="./debugfs.html">debugfs</a>
used to manually view or modify internal structures of the file system</li>
<li><a href="./dumpe2fs.html">dumpe2fs</a>
which prints superblock and block group information.</li>
<li><a href="./e2freefrag.html">e2freefrag</a>
report free space fragmentation information</li>
<li><a href="./e2fsck.html">e2fsck</a>
an fsck program that checks for and corrects inconsistencies</li>
<li><a href="./e2image.html">e2image</a>
save critical ext2/ext3/ext4 filesystem metadata to a file</li>
<li><a href="./e2label.html">e2label</a>
change the label on an ext2/ext3/ext4 filesystem</li>
<li><a href="./e2undo.html">e2undo</a>
replay an undo log for an ext2/ext3/ext4 filesystem</li>
<li><a href="./e4defrag.html">e4defrag</a>
online defragmenter for ext4 filesystem</li>
<li><a href="./filefrag.html">filefrag</a>
report on file fragmentation</li>
<li><a href="./findfs.html">findfs</a>
find a filesystem by label or UUID</li>
<li><a href="./findsuper.html">findsuper</a>
quick hacked up program to find ext2 superblocks</li>
<li><a href="./logsave.html">logsave</a>
save the output of a command in a logfile</li>
<li><a href="./lsattr.html">lsattr</a>
list file attributes on a Linux second extended file system</li>
<li><a href="./mke2fs.html">mke2fs</a>
used for creating ext2, ext3 and ext4 file systems</li>
<li><a href="./resize2fs.html">resize2fs</a>
which can expand and shrink ext2, ext3 and ext4 file systems</li>
<li><a href="./tune2fs.html">tune2fs</a>
used to modify file system parameters</li>
</ul>
</div>
</div>

<div id="outline-container-orgc15dea8" class="outline-3">
<h3 id="check"><a id="orgc15dea8"></a>Check</h3>
<div class="outline-text-3" id="text-check">
</div>

<div id="outline-container-orgec4886d" class="outline-4">
<h4 id="orgec4886d">badblocks</h4>
<div class="outline-text-4" id="text-orgec4886d">
</div>
</div>

<div id="outline-container-org64ac5e9" class="outline-4">
<h4 id="org64ac5e9">blkid</h4>
<div class="outline-text-4" id="text-org64ac5e9">
</div>
</div>

<div id="outline-container-org1ba8dac" class="outline-4">
<h4 id="org1ba8dac">chattr</h4>
<div class="outline-text-4" id="text-org1ba8dac">
<p>
See <a href="./chattr.html#check">chattr</a>.
</p>
</div>
</div>

<div id="outline-container-org9f1b29d" class="outline-4">
<h4 id="org9f1b29d">debugfs</h4>
<div class="outline-text-4" id="text-org9f1b29d">
</div>
</div>

<div id="outline-container-org7902fd9" class="outline-4">
<h4 id="org7902fd9">dumpe2fs</h4>
<div class="outline-text-4" id="text-org7902fd9">
</div>
</div>

<div id="outline-container-org49764d6" class="outline-4">
<h4 id="org49764d6">e2freefrag</h4>
<div class="outline-text-4" id="text-org49764d6">
</div>
</div>

<div id="outline-container-orgfc0b005" class="outline-4">
<h4 id="orgfc0b005">e2fsck</h4>
<div class="outline-text-4" id="text-orgfc0b005">
</div>
</div>

<div id="outline-container-org9851130" class="outline-4">
<h4 id="org9851130">e2image</h4>
<div class="outline-text-4" id="text-org9851130">
</div>
</div>

<div id="outline-container-orgdbc5003" class="outline-4">
<h4 id="orgdbc5003">e2label</h4>
<div class="outline-text-4" id="text-orgdbc5003">
</div>
</div>

<div id="outline-container-org5d87f0b" class="outline-4">
<h4 id="org5d87f0b">e2undo</h4>
<div class="outline-text-4" id="text-org5d87f0b">
</div>
</div>

<div id="outline-container-orgbbe2b90" class="outline-4">
<h4 id="orgbbe2b90">e4defrag</h4>
<div class="outline-text-4" id="text-orgbbe2b90">
</div>
</div>

<div id="outline-container-org2cb3e7b" class="outline-4">
<h4 id="org2cb3e7b">filefrag</h4>
<div class="outline-text-4" id="text-org2cb3e7b">
</div>
</div>

<div id="outline-container-orgc88df9a" class="outline-4">
<h4 id="orgc88df9a">findfs</h4>
<div class="outline-text-4" id="text-orgc88df9a">
</div>
</div>

<div id="outline-container-org07dcddf" class="outline-4">
<h4 id="org07dcddf">findsuper</h4>
<div class="outline-text-4" id="text-org07dcddf">
</div>
</div>

<div id="outline-container-orgae7d249" class="outline-4">
<h4 id="orgae7d249">logsave</h4>
<div class="outline-text-4" id="text-orgae7d249">
</div>
</div>

<div id="outline-container-orgee91ab9" class="outline-4">
<h4 id="orgee91ab9">lsattr</h4>
<div class="outline-text-4" id="text-orgee91ab9">
<p>
See <a href="./lsattr.html#check">lsattr</a>.
</p>
</div>
</div>

<div id="outline-container-org8398c18" class="outline-4">
<h4 id="org8398c18">mke2fs</h4>
<div class="outline-text-4" id="text-org8398c18">
</div>
</div>

<div id="outline-container-orgbd6a453" class="outline-4">
<h4 id="orgbd6a453">resize2fs</h4>
<div class="outline-text-4" id="text-orgbd6a453">
</div>
</div>

<div id="outline-container-org9b849fe" class="outline-4">
<h4 id="org9b849fe">tune2fs</h4>
<div class="outline-text-4" id="text-org9b849fe">
</div>
</div>
</div>
</div>

<div id="outline-container-org86e6816" class="outline-2">
<h2 id="usage"><a id="org86e6816"></a>Usage</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-orgeb06984" class="outline-4">
<h4 id="orgeb06984">badblocks</h4>
<div class="outline-text-4" id="text-orgeb06984">
</div>
</div>

<div id="outline-container-orgfcac701" class="outline-4">
<h4 id="orgfcac701">blkid</h4>
<div class="outline-text-4" id="text-orgfcac701">
</div>
</div>

<div id="outline-container-orgab959b2" class="outline-4">
<h4 id="orgab959b2">chattr</h4>
<div class="outline-text-4" id="text-orgab959b2">
<p>
See <a href="./chattr.html#usage">chattr</a>.
</p>
</div>
</div>

<div id="outline-container-orgc47917c" class="outline-4">
<h4 id="orgc47917c">debugfs</h4>
<div class="outline-text-4" id="text-orgc47917c">
</div>
</div>

<div id="outline-container-orge51705e" class="outline-4">
<h4 id="orge51705e">dumpe2fs</h4>
<div class="outline-text-4" id="text-orge51705e">
</div>
</div>

<div id="outline-container-orgabf8ca6" class="outline-4">
<h4 id="orgabf8ca6">e2freefrag</h4>
<div class="outline-text-4" id="text-orgabf8ca6">
</div>
</div>

<div id="outline-container-orgb9575ea" class="outline-4">
<h4 id="orgb9575ea">e2fsck</h4>
<div class="outline-text-4" id="text-orgb9575ea">
</div>
</div>

<div id="outline-container-orgdfd17b8" class="outline-4">
<h4 id="orgdfd17b8">e2image</h4>
<div class="outline-text-4" id="text-orgdfd17b8">
</div>
</div>

<div id="outline-container-orge82cb81" class="outline-4">
<h4 id="orge82cb81">e2label</h4>
<div class="outline-text-4" id="text-orge82cb81">
</div>
</div>

<div id="outline-container-orge0213b6" class="outline-4">
<h4 id="orge0213b6">e2undo</h4>
<div class="outline-text-4" id="text-orge0213b6">
</div>
</div>

<div id="outline-container-org4c2269e" class="outline-4">
<h4 id="org4c2269e">e4defrag</h4>
<div class="outline-text-4" id="text-org4c2269e">
</div>
</div>

<div id="outline-container-orgb1a279d" class="outline-4">
<h4 id="orgb1a279d">filefrag</h4>
<div class="outline-text-4" id="text-orgb1a279d">
</div>
</div>

<div id="outline-container-orgac8efba" class="outline-4">
<h4 id="orgac8efba">findfs</h4>
<div class="outline-text-4" id="text-orgac8efba">
</div>
</div>

<div id="outline-container-org406bcba" class="outline-4">
<h4 id="org406bcba">findsuper</h4>
<div class="outline-text-4" id="text-org406bcba">
</div>
</div>

<div id="outline-container-orgffa8c78" class="outline-4">
<h4 id="orgffa8c78">logsave</h4>
<div class="outline-text-4" id="text-orgffa8c78">
</div>
</div>

<div id="outline-container-orge6034b1" class="outline-4">
<h4 id="orge6034b1">lsattr</h4>
<div class="outline-text-4" id="text-orge6034b1">
<p>
See <a href="./lsattr.html#usage">lsattr</a>.
</p>
</div>
</div>

<div id="outline-container-org8f88c28" class="outline-4">
<h4 id="org8f88c28">mke2fs</h4>
<div class="outline-text-4" id="text-org8f88c28">
</div>
</div>

<div id="outline-container-orgf35d6a3" class="outline-4">
<h4 id="orgf35d6a3">resize2fs</h4>
<div class="outline-text-4" id="text-orgf35d6a3">
</div>
</div>

<div id="outline-container-orgd09feb6" class="outline-4">
<h4 id="orgd09feb6">tune2fs</h4>
<div class="outline-text-4" id="text-orgd09feb6">
</div>
</div>
</div>

<div id="outline-container-orgd4377aa" class="outline-2">
<h2 id="references"><a id="orgd4377aa"></a>References</h2>
<div class="outline-text-2" id="text-references">
<ul class="org-ul">
<li><a href="http://e2fsprogs.sourceforge.net/">Offical Homepage</a></li>
<li><a href="https://git.kernel.org/pub/scm/fs/ext2/e2fsprogs.git">Source code</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-03-05</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-03-06 Tue 12:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
